Documents/СведенияОбИмуществе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СведенияОбИмуществе</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СведенияОбИмуществе</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Имущество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Имущество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СвойстваИмущества</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/СведенияОбИмуществе/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.Имущество) Тогда
	
		УстановитьТипИмущества(Объект.Имущество);
	
	КонецЕсли;
	
	Объект.Источник = Справочники.ИсточникиСведений.РучнойВвод;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоПриИзменении(Элемент)
	
	ИмуществоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ИмуществоПриИзмененииНаСервере()

	ТипыИмущества.Очистить();
	УстановитьТипИмущества(Объект.Имущество);
	ПроверитьКорректностьСвойств(ТипыИмущества);

КонецПроцедуры

&НаСервере
Процедура УстановитьТипИмущества(Имущество)

	ДопустимыеТипы = Справочники[Имущество.Метаданные().Имя].ДопустимыеВариантыСвойст();
	Для каждого ДопустимыйТип Из ДопустимыеТипы Цикл
	
		ВыводимыйТип = ТипыИмущества.Добавить();
		ВыводимыйТип.Тип = ДопустимыйТип;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПроверитьКорректностьСвойств(КонтролирующийТипИмущества)

	ПроверитьЗаполнение();

КонецПроцедуры

&НаКлиенте
Процедура ДанныеСвойствоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	ТипСвойства = ТекущиеДанные.Свойство.ТипЗначения;
	
	ТекущиеДанные.Значение = УправлениеДанными.ЗначениеПоУмолчанию(ТипСвойства);

КонецПроцедуры

&НаКлиенте
Процедура ДанныеЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.Данные.ТекущиеДанные;
	УправлениеДанными.ОграничитьТипыЗначения(
		ТекущиеДанные.Свойство,
		Элемент
	);

КонецПроцедуры
